{"intents": [
    {"tag": "welcome", "patterns": ["Hi", "Hello", "How are you", "whats up", "How do you do", "How’s the day?", "Hey are you there", "How is everything going", "glad to meet you"], "responses": ["Hello", "Glad to see you again", "Hi there, How can I help  you", "Hello! what you are looking for?", "Hello, how may I help you"]},
    {
        "tag": "interest",
        "patterns": ["What Is an Interest Rate", "How Are Interest Rates Determined?", "what is APR", "what is APY", "what is simple interest", "what is compound interest"],
        "responses" : ["The amount charged on top of the principal by a lender to a borrower for the use of assets.","A country's central bank sets the interest rate, which each bank uses to determine the APR range they offer.", "Interest rates on consumer loans are typically quoted as the annual percentage rate (APR). ", "The annual percentage yield (APY) is the interest rate that is earned at a bank or credit union from a savings account or CD." , "Simple interest is determined by multiplying the daily interest rate by the principal by the number of days that elapse between payments.", "Compound interest accrues and is added to the accumulated interest of previous periods, so borrowers must pay interest on interest as well as principal."],
        
    },
    {
        "tag" : "finance",
        "patterns" : ["What is Finance", "what is investment banking", "what is asset wealth management", "what is banking", "what is insurance", "what is accounting"],
        "responses" : ["Finance deals with all aspects of money management including investment banking, asset Wealth Management, banking, insurance, accounting.","It involves advising companies on mergers & acquisitions, debt financing, equity offerings, etc." , "This includes investment funds like a mutual fund or hedge fund which invest in stocks, bonds, real estate, commodities, derivatives, currencies, etc.", "The term ‘Banking’ refers to a wide range of activities that banks perform such as lending, borrowing, investing, trading, asset securitization, credit analysis, etc.", "Insurers protect against risks associated with life events like death, disability, unemployment, illness, accidents, natural disasters, etc.", "Accountants prepare accounts for businesses so they can make informed decisions about their finances. They also help them manage cash flow, taxes, investments, etc. There are three main categories of accountancy; namely, auditing, tax preparation, and bookkeeping."],
        
    },
    {
        "tag" : "jobs",
        "patterns" : ["Investment Banker", "Management Consultant", "International Banking"],
        "responses" : ["The primary job roles of an investment banker, who is a part of any monetary establishment, include raising capital for companies, governments, or different institutions.", "Overall, Management Consultants assist associations with taking care of business problems, giving answers for changing business needs, and fostering game plans to execute proposed arrangements.", " required to have extensive knowledge of international banking to handle and control a broad range of major international companies, transactions, FX, credit cards, mortgages, general banking, M&A, and real estate."],
        
    },
    {
        "tag" : "credit",
        "patterns" : ["What Is Credit?", "How Credit Works", "what are types of Credit", "what is credit in Financial Accounting", "What is credit theory"],
        "responses" : ["credit is generally defined as a contract agreement in which a borrower receives a sum of money or something of value and repays the lender at a later date, generally with interest.", "Credit is essentially a social relation that forms between a creditor (lender) and a borrower (debtor). The debtor promises to repay the lender, often with interest, or risk financial or legal penalties. Extending credit is a practice that goes back thousands of years, to the dawn of human civilization.", "There are many different forms of credit. The most popular form is bank credit or financial credit. credit can refer to a reduction in the amount one owes. Financial resources are not the only form of credit that may be offered. There may be an exchange of goods and services in exchange for a deferred payment, which is another type of credit. When suppliers give products or services to an individual but don't require payment until later, that is a form of credit.", "In the context of personal banking or financial accounting, a credit is an entry recording a sum that has been received. Traditionally, credits (deposits) appear on the right-hand side of a checking account register, and debits (money spent) appear on the left.", "The credit theory of money argues that all money (whether fiat or backed by something) is a form of credit."],
        
    },
    {
        "tag" : "invest",
        "patterns" : ["what is Investing","what is Asset allocation","what is Time horizon","what is Diversification","what is Risk tolerance"],
        "responses" : ["What is the simple definition of investing? An investment involves putting capital to use today in order to increase its value over time. An investment requires putting capital to work, in the form of time, money, effort, etc., in hopes of a greater payoff in the future than what was originally put in.", "How you divide your assets up across all of your investments", "The number of years before you expect to need the money you’re investing", "The practice of spreading your money across many different investments", "Your ability and willingness to lose money in the stock market"],
        
    },
    {
        "tag" : "tax",
        "patterns" : ["What Are Taxes?", "What are Types of Taxes", "what is Income Tax", "what is payroll tax", "what is corporate tax", "Who Needs to Pay Taxes?", "What is tax Delinquency"],
        "responses" : ["To help fund public works and services—and to build and maintain the infrastructure used in a country—a government usually taxes its individual and corporate residents. The tax collected is used for the betterment of the economy and all who are living in it.", "income tax, payroll tax, corporate tax, sales tax, property tax, tariff, etc.", "Income tax is a type of tax that governments impose on income generated by businesses and individuals within their jurisdiction.", "Payroll taxes are withheld from an employee’s paycheck by an employer, who remits the amount to the federal government to fund Medicare and Social Security programs.", "Corporate taxes are paid on a company’s taxable income. ", "The taxpayer will depend on the type of tax and associated regulation for that tax. For example, federal income tax legislation usually only pertains to people who have earned a certain amount of income or adjusted gross income. Corporate taxes may be limited to companies that have performed business in a specific area or are incorporated to do business within a specific country.", "Every type of tax has a different due date or reporting requirement. Some are collected immediately at the time of a transaction or leading up to a transaction like sales taxes or tariffs. Others are on a fixed recurring schedule with a due date repeating on a specific date or specific day/month combination (i.e. property taxes being due the first day of April). "],
        
    },
    {
        "tag" : "insurance",
        "patterns" : ["What is insurance" , "Types of Insurance", "Is insurance an asset?"],
        "responses" : ["Put simply, insurance is a contract, represented by a policy, in which a policyholder receives financial protection or reimbursement against losses from an insurance company. The company pools clients’ risks to make payments more affordable for the insured.", "A multitude of different types of insurance policies is available, and virtually any individual or business can find an insurance company willing to insure them—for a price. The most common types of personal insurance policies are auto, health, homeowners, and life. Most individuals in the United States have at least one of these types of insurance, and car insurance is required by law.", "Health Insurance, Home Insurance, Auto Insurance, Life Insurance, Travel Insurance", "Depending on the type of life insurance policy and how it is used, permanent life insurance can be considered a financial asset because of its ability to build cash value or be converted into cash. Simply put, most permanent life insurance policies have the ability to build cash value over time."],
        
    },
    {
        "tag" : "debt",
        "patterns" : ["What Is Debt?", "What Are Examples of Debt?", "How Can I Get Out of Debt Fast?", "What Is Debt Consolidation?", "What Is the Difference Between Debt and a Loan?", "What is Mortgage"],
        "responses" : ["Debt is something, usually money, borrowed by one party from another. Debt is used by many corporations and individuals to make large purchases that they could not afford under normal circumstances.", "Debt is anything owed by one party to another. Examples of debt include amounts owed on credit cards, car loans, and mortgages.", "How soon you can get out of debt depends on how much debt you have and how much more you can pay to reduce it. Create a plan, set a budget, and do not acquire more debt. Consider restricting nonessential spending and use what you save to pay down your debt.", "Debt consolidation involves acquiring new debt to pay off multiple, existing debts. The new loan becomes the single source of debt, which usually results in a lower overall payment, a reduced interest rate, and a new repayment schedule.", "Debt and loan are used synonymously, but there are slight differences. Debt is anything owed by one person to another. Debt can involve real property, money, services, or other consideration. In finance, debt is more narrowly defined as money raised through the issuance of bonds. A loan is a form of debt but, more specifically, is an agreement in which one party lends money to another. The lender sets repayment terms, including how much is to be repaid and when. They also may establish that the loan must be repaid with interest." , "A mortgage is a debt issued to purchase real estate, such as a house or condo. It is a form of secured debt as the subject real estate is used as collateral against the loan. However, mortgages are so unique that they deserve their own debt classification."],
        
    },
    {
        "tag" : "bank",
        "patterns" : ["What Is a Bank?","How banks work","What are some Basic Bank Services","What are the Types of Banks","How Do I Know My Money Is Safe in a Bank?"],
        "responses": ["A bank is a financial institution that is licensed to accept checking and savings deposits and make loans. Banks also provide related services such as individual retirement accounts (IRAs), certificates of deposit (CDs), currency exchange, and safe deposit boxes.","Banks have existed since at least the 14th century. They provide a safe place for consumers and business owners to stow their cash and a source of loans for personal purchases and business ventures. In turn, the banks use the cash that is deposited to make loans and collect interest on them.","Checking accounts, saving accounts, loan servies, etc.","Retail Banks, Commercial or Corporate Banks, Investment Banks, Central Banks","The Federal Deposit Insurance Corporation (FDIC) is an independent agency created by Congress to maintain stability and public confidence in the U.S. financial system. The FDIC supervises and examines banks to ensure that the money they handle is safe. Moreover, it insures your money. The insurance maximum is $250,000 per depositor, per insured bank, for each account ownership category."],
        
    },
    {
        "tag" : "bitcoin",
        "patterns" : ["What Is Bitcoin?","Is bitcoin world's largest cryptocurrency","What is the history behind bitcoin","What is the technology behind bitcoin","How to Mine Bitcoin","How Do You Buy Bitcoin?"],
        "responses": ["Bitcoin is a cryptocurrency, a virtual currency designed to act as money and a form of payment outside the control of any one person, group, or entity, and thus removing the need for third-party involvement in financial transactions."," Bitcoin is the world's largest cryptocurrency by market capitalization.","Bitcoin's history as a store of value has been turbulent; it has gone through several boom and bust cycles over its relatively short lifespan. As the earliest virtual currency to meet widespread popularity and success, Bitcoin has inspired a host of other cryptocurrencies in its wake.","Cryptocurrencies are part of a blockchain and the network required to power it. A blockchain is a distributed ledger, a shared database that stores data. Data within the blockchain are secured by encryption methods. When a transaction takes place on the blockchain, information from the previous block is copied to a new block with the new data, encrypted, and the transaction is verified by validators—called miners—in the network.","A variety of hardware and software can be used to mine Bitcoin. When Bitcoin was first released, it was possible to mine it competitively on a personal computer. However, as it became more popular, more miners joined the network, which lowered the chances of being the one to solve the hash. You can still use your personal computer as a miner if it has newer hardware, but the chances of solving a hash are individually are minuscule.","If you don't want to mine bitcoin, it can be bought using a cryptocurrency exchange. Most people will not be able to purchase an entire BTC because of its price, but you can buy portions of BTC on these exchanges in fiat currency like U.S. dollars. For example, you can buy bitcoin on Coinbase by creating an account and funding it."],
        
    },
    {
        "tag" : "Cryptocurrency",
        "patterns" : ["What Is Cryptocurrency?","What are pros of Cryptocurrency","What are cons of Cryptocurrency","What are the Types of Cryptocurrency","Are Cryptocurrencies Legal?"],
        "responses": ["A cryptocurrency is a digital or virtual currency that is secured by cryptography, which makes it nearly impossible to counterfeit or double-spend. Many cryptocurrencies are decentralized networks based on blockchain technology—a distributed ledger enforced by a disparate network of computers.","The advantages of cryptocurrencies include cheaper and faster money transfers and decentralized systems that do not collapse at a single point of failure.","The disadvantages of cryptocurrencies include their price volatility, high energy consumption for mining activities, and use in criminal activities.","Bitcoin, Ethereum, Ripple, Solana, Cardano, EOS, etc.","Fiat currencies derive their authority from the government or monetary authorities. For example, each dollar bill is backstopped by the Federal Reserve. But cryptocurrencies are not backed by any public or private entities. Therefore, it has been difficult to make a case for their legal status in different financial jurisdictions throughout the world. It doesn't help matters that cryptocurrencies have largely functioned outside most existing financial infrastructure."],
        
    },
    {
        "tag" : "NFT",
        "patterns" : ["What Is a NFT?", "Can you tell more about NFT","Give an Example of NFTs","How Can I Buy NFTs?","Are NFTs Safe?"],
        "responses": ["Non-fungible tokens (NFTs) are cryptographic assets on a blockchain with unique identification codes and metadata that distinguish them from each other. Unlike cryptocurrencies, they cannot be traded or exchanged at equivalency. This differs from fungible tokens like cryptocurrencies, which are identical to each other and, therefore, can serve as a medium for commercial transactions.","NFTs evolved from the ERC-721 standard. Developed by some of the same people responsible for the ERC-20 smart contract, ERC-721 defines the minimum interface—ownership details, security, and metadata—required for the exchange and distribution of gaming tokens. The ERC-1155 standard takes the concept further by reducing the transaction and storage costs required for NFTs and batching multiple types of non-fungible tokens into a single contract.","Perhaps the most famous use case for NFTs is that of cryptokitties. Launched in November 2017, cryptokitties are digital representations of cats with unique identifications on Ethereum’s blockchain. Each kitty is unique and has a price in ether. They reproduce among themselves and produce new offspring, which have different attributes and valuations compared to their parents.","Many NFTs can only be purchased with Ether, so owning some of this cryptocurrency—and storing it in a digital wallet—is usually the first step. You can then purchase NFTs via any of the online NFT marketplaces, including OpenSea, Rarible, and SuperRare.","Non-fungible tokens, which use blockchain technology just like cryptocurrency, are generally secure. The distributed nature of blockchains makes NFTs difficult (although not impossible) to hack. One security risk for NFTs is that you could lose access to your non-fungible token if the platform hosting the NFT goes out of business."],
        
    },
    {
        "tag" : "state street",
        "patterns" : ["what is state street?","state street","statestreet","what is statestreet"],
        "responses": ["State Street Corporation is an American financial services and bank holding company headquartered at One Lincoln Street in Boston with operations worldwide. It is the second-oldest continually operating United States bank; its predecessor, Union Bank, was founded in 1792."],
        
    },
    {
        "tag" : "economy",
        "patterns" : ["What Is an Economy?", "What are Types of Economies", "What is GDP", "What is Inflation"],
        "responses": ["An economy is a complex system of interrelated production, consumption, and exchange activities that ultimately determines how resources are allocated among all the participants. The production, consumption, and distribution of goods and services combine to fulfill the needs of those living and operating within the economy.", "Market-Based Economies, Command-Based Economies, Mixed Economies.", "Gross domestic product(GDP) is the total value of all of the completed goods and services produced by an economy during a period of one year.", "Inflation in consumer prices is measured and tracked so that problems in the economy can be pinpointed. If the rate of inflation is outpacing the rate of income growth, the economy is in trouble. Inflation can be negative, too, but overall deflation is relatively rare."],
        
    },
    {
        "tag": "stock",
        "patterns" : ["What Are Stocks?","What Is Shareholder Ownership?","How to Compare Common and Preferred Stock","How Do You Buy Stock?","What is stock market", "What is stock exchange"],
        "responses" : ["A stock, also known as equity, is a security that represents the ownership of a fraction of the issuing corporation. Units of stock are called shares which entitles the owner to a proportion of the corporation's assets and profits equal to how much stock they own. ","What shareholders own are shares issued by the corporation, and the corporation owns the assets held by a firm. If you own 33% of the shares of a company, it is incorrect to assert that you own one-third of that company. However, you do own one-third of the company’s shares. This is known as the “separation of ownership and control.” ","There are two main types of stock: common and preferred. Common stock usually entitles the owner to vote at shareholders' meetings and to receive any dividends paid out by the corporation. Preferred stockholders generally do not have voting rights, though they have a higher claim on assets and earnings than common stockholders. For example, owners of preferred stock receive dividends before common shareholders and have priority if a company goes bankrupt and is liquidated.", "Most often, stocks are bought and sold on stock exchanges, such as the Nasdaq or the New York Stock Exchange (NYSE). After a company goes public through an initial public offering (IPO), its stock becomes available for investors to buy and sell on an exchange. ", "The term stock market refers to several exchanges in which shares of publicly held companies are bought and sold. Such financial activities are conducted through formal exchanges and via over-the-counter (OTC) marketplaces that operate under a defined set of regulations. ", "Both “stock market” and “stock exchange” are often used interchangeably."],
        
    },
    {
        "tag": "loan",
        "patterns" : ["What Is a Loan?","How do you get loan","What are components of a loan","How to get a loan"],
        "responses" : ["The term loan refers to a type of credit vehicle in which a sum of money is lent to another party in exchange for future repayment of the value or principal amount. In many cases, the lender also adds interest or finance charges to the principal value which the borrower must repay in addition to the principal balance.","Loans are advanced for a number of reasons including major purchases, investing, renovations, debt consolidation, and business ventures. Loans also help existing companies expand their operations. Loans allow for growth in the overall money supply in an economy and open up competition by lending to new businesses.","Principal, loan term, interest rate, loan payments.", "A loan may be secured by collateral such as a mortgage or it may be unsecured such as a credit card."],
        
    },
    {
        "tag": "mutual fund",
        "patterns" : ["What Is a Mutual Fund?","How Are Mutual Funds Priced?","What are Exchange Traded Funds (ETFs)"],
        "responses" : ["A mutual fund is a financial vehicle that pools assets from shareholders to invest in securities like stocks, bonds, money market instruments, and other assets.","The value of the mutual fund depends on the performance of the securities in which it invests. When buying a unit or share of a mutual fund, an investor is buying the performance of its portfolio or, more precisely, a part of the portfolio's value.","A twist on the mutual fund is the exchange-traded fund (ETF). They are not considered mutual funds but employ strategies consistent with mutual funds. They are structured as investment trusts that are traded on stock exchanges and have the added benefits of the features of stocks."],
        
    },
    {
        "tag": "real estate",
        "patterns" : ["What Is Real Estate?","Who is a Real Estate Agent","What Are Types of Real Estate?"],
        "responses" : ["Real estate is defined as the land and any permanent structures, like a home, or improvements attached to the land, whether natural or man-made. Real estate is a form of real property. It differs from personal property, which is not permanently attached to the land, such as vehicles, boats, jewelry, furniture, and farm equipment.","A real estate agent is a licensed professional who arranges real estate transactions, matching buyers and sellers and acting as their representatives in negotiations. ","Residential real estate, commercial real estate, industrial real estate, land, special purpose."],
        
    },
    {
        "tag": "asset",
        "patterns" : ["What Is an Asset?","What are the types of Assets","What Are Examples of Assets?"],
        "responses" : ["An asset is a resource with economic value that an individual, corporation, or country owns or controls with the expectation that it will provide a future benefit. Assets are reported on a company's balance sheet. They're classified as current, fixed, financial, and intangible. They are bought or created to increase a firm's value or benefit the firm's operations.","Current assets, fixed Assets, financial Assets, Intangible Assets.","Personal assets can include a home, land, financial securities, jewelry, artwork, gold and silver, or your checking account. Business assets can include such things as motor vehicles, buildings, machinery, equipment, cash, and accounts receivable."],
        
    },
     {"tag": "endingnote", "patterns": ["see you. bye", "Good Bye", "ok then bye", "That’ s enough for me", " Im leaving", "See u later! Goodbye", "nice to meet you", "The bargaining session was fun!I’m happy that I got it at cheap price, see u again", "Enjoyed the experience, good bye"], "responses": ["Hey, Thank you for visiting", "Hope to see you again, it was nice talking with you", " wish you a good day! Hope to have a talk with you later", "Thanks for your time with us.Hope you enjoyed it and satisfied. See you later", "Sad to see you go. Come whenever you need to bye from us. Stay intouch."]}, {"tag": "name", "patterns": ["whats you name?", "who are you?", "what can I call you", "tell me your name", "Are u a robot", "Are you a chatbot"], "responses": ["It’s VioLeTT here, a digital+financial assistant to help you out", "You can call me VioLeTT.Im a chatRobot/chatbot, tell me what you want", "I’m VioLeTT,a digital+financial assistant, I can guide you in our ecommerce website.", "Its VioLeTT Here,a digital +financial assistant. How may I help you?"]}, {"tag": "shopping", "patterns": ["I would like to buy something here", "can I buy something", "What all things are there", "can you recommend me something from here", "is there any thing cheaper here", "Hey, I want a black shoe"], "responses": ["Yes please, we have a lot of new collections for you", "Ofcourse, there are new offers for you, fantastic selections, choose what interests you!", "Well casual shoes at Rs 220, this offer won’t stay much", "there are good varieties of coloured shoes too also there are black formal shoes. Take one"]}, {"tag": "time period", "patterns": ["till what time this be offered?", "When will the shop close?", "when will the shop open", "How much time it will take for delivery", "When will this site close?", "When are you people open", "When will this store be open?", "Is this store will be open at Sunday?"], "responses": ["Our shop centre will be open from 9 am-9pm in all the days", "Yes, we are operating on all the weekdays from 9 am to 9pm", "We are there to provide services from Monday-sunday from 9 am-9pm", "We are operating from 9 am-9 pm every day"]}, {"tag": "location", "patterns": ["What is your location?", "Where are you located?", "What is your address?", "Where is your restaurant situated?"], "responses": ["We are on the intersection of state Alley and Techno Avenue, Delhi, India", "We are situated at the intersection of  state Alley and Techno Avenue in Delhi, India", "Our Address is: 1000 Techno Avenue, Delhi, India"]}, {"tag": "payments", "patterns": ["Do you take credit cards?", "Do you accept Mastercard?", "Are you cash only?", "will you accept credit card", "can i pay by credit card"], "responses": ["We accept VISA, Mastercard and AMEX", "We accept most major credit cards"]}, {"tag": "todaysOffers", "patterns": ["What is the new collections for today?", "What new collections you have today?", "Tell me today's collection"], "responses": ["We have buy one get one offer for kurtis and shirts. Also new colour selections of traditional wears", "Our speciality for today is trendy new collections of traditional wears and also buy one get one offer for some things"]}, {"tag": "deliveryoption", "patterns": ["Do you provide delivery to home?", "Do you deliver the clothes?", "What are the home delivery options?", "Tell me the delivery options you have"], "responses": ["Yes, we provide home delivery of the proiducts through our agents?", "We have home delivery options through our agents"]}, {"tag": "price of formal wear", "patterns": ["what is the price for a formal wear", "How much will it cost to buy a formal wear", "Will it be much expensive to buy a branded suit, how much is the average cost"], "responses": ["For  a formal wear it will cost in a range of 750-2500 Rs according to your selection", "There are a number of varieties of suits or formal wears ranging from 500-1500", "Its not much expensive to have the same. There are several discounts available", "it has an average cost of 1200 Rs"]}, {"tag": "price of a saree", "patterns": ["what is the price for a saree", "How much will it cost to buy a saree", "What is the cost of a saree", "Cost of a saree", "Price of a saree"], "responses": ["The price of saree depends upon the colour and design of the same ", "We have collections of trending sarees ranging from 500Rs to 10000 Rs"], "context_set": ""}, {"tag": "Thank you", "patterns": ["Thank you", "Thank you so much for your help"], "responses": ["Its my pleasure.", "You are welcome", "No problem. Its my pleasure to help you"]}, {"tag": "Bargain offer", "patterns": ["Can i bargain for any product today", "For what product do you have bargaining offer today", "can you bargain today", "can I bargain today", "Which product can I bargain today", "Tell me is there a product to bargain"], "responses": ["Yes, we have a bargaining offer for ribbon today. Its rated price is 30 Rs", "yes, today you can bargaining for a ribbon. its rated price is 30 Rs"]}, {"tag": "bitcoin", "patterns": ["tell me the value of a bitcoin", "what is bitcoin", "Can you tell more about bitcoin?", "What can be bitcoin", "what do you mean by bitcoin"], "responses": ["1 Bitcoin equals 14,14,998.64 Indian Rupee", "Bitcoin is a digital or virtual currency created in 2009 that uses peer-to-peer technology to facilitate instant payments", "Bitcoin is a cryptocurrency created in 2009. Marketplaces called “bitcoin exchanges” allow people to buy or sell bitcoins using different currencies"]}, {"tag": "AsymmetricInformation", "patterns": ["what is Asymmetric Information", "Tell me about Asymmetric information in finance markets", "Do you know about Asymmetric information", "What can be Asymmetric information", "what do you mean by Asymmetric information"], "responses": ["It is a type of market failure exists when one individual or party has much more information than another individual or party, and uses that advantage to exploit the other party.", "Finance is a market in information – often a potential borrower (such as a small business) has better information on the likelihood that they will be able to repay a loan than the lender."]}, {"tag": "bail-out", "patterns": ["what is bail-out", "Do you know about bail-out in financial markets", "Tell me about bailout", "What does critics and supporter say about bail-out", "bail-out"], "responses": ["A bail-out happens when a government buys an equity stake in a bank or some other form of financial support to prevent it from failing", "Critics of bail-outs argue that it can increase the burden facing taxpayers and also increase the risk of moral hazard.Supporters of bail-outs claim that they are sometimes necessary during a financial crisis to help reduce systemic risk.", " Bail outs have become prominent once again because of the economic and social consequences of the coronavirus crisis."]}, {"tag": "Balance sheet", "patterns": ["what is a balance sheet", "Tell me about Balance sheet", "Do you know Balance sheet?", "Balance sheet", "What can be Balance sheet", "what do you mean by Balance sheet"], "responses": ["A record of the assets, liabilities, and net worth of an economic actor such as a household, commercial or central bank, firm, or government", "A balance sheet is a financial statement that reports a company's assets, liabilities and shareholders' equity.", "The balance sheet is one of the three (income statement and statement of cash flows being the other two) core financial statements used to evaluate a business."]}, {"tag": "bank", "patterns": ["what is a bank", "What exactly bank does", "can you tell me about bank", "bank", "What can be bank", "what do you mean by bank"], "responses": ["A bank in simple terms is a business that makes its profit by paying interest to those who keep money there and charging a higher rate of interest to people/businesses who borrow money from the bank"]}, {"tag": "bank assests", "patterns": ["what are bank assets", "Tell me about bank assets", "what is bank asset", "bank assets", "what is mean by bank assets", "bank assets", "What can be bank assets", "what do you mean by bank assets"], "responses": ["Assets are “owned” by the bank e.g. cash, balances at Bank of England, loans (Advances), securities (e.g. Bonds) and fixed assets."]}, {"tag": "Bank capital", "patterns": ["what is mean by bank capital?", "do you know bank capital?", "what is bank capital", "bank capital", "Tell me about Bank capital", "What can be Bank capital", "what do you mean by Bank capital"], "responses": ["Bank capital is the value of the bank's assets minus its liabilities, or debts."]}, {"tag": "Bond market", "patterns": ["what is mean by bond market?", "do you know bond market?", "what is bond market?", "Bond Market", "What can be Bond Market", "what do you mean by Bank Market"], "responses": ["The bond market broadly describes a marketplace where investors buy debt securities that are brought to the market by either governmental entities or publicly-traded corporations", "The market for interest-bearing securities (with either a fixed or a floating rate and with a maturity of at least one year) that companies and governments issue to raise capital for investment."]}, {"tag": "Bank Run", "patterns": ["what is mean by Bank Run?", "What is bank run and how it occurs?", "Do you know about bank run?", "Bank Run", "What can be bank run", "what do you mean by bank run"], "responses": ["A situation in which depositors withdraw funds from a commercial bank because they fear that it may go bankrupt and not honour its liabilities such as the deposits of the bank's savers.", "A bank run occurs when a large number of customers of a bank or other financial institution withdraw their deposits simultaneously over concerns of the bank's solvency."]}, {"tag": "Bank reserves", "patterns": ["what is mean by bank reserves?", "do you know bank reserves?", "Bank reserves and how it works", "what is bank reserves", "Bank reserves", "What can be Bank reserves", "what do you mean by Bank reserves"], "responses": ["Money and liquid assets (such as securities that can be sold quickly) held by banks in order to meet withdrawals by customers.", "Bank reserves are the cash minimums that must be kept on hand by financial institutions in order to meet central bank requirements"]}, {"tag": "Capital market", "patterns": ["what is mean by a capital market?", "capital market?", "do you know Capital market?", "Tell me about capital market", "capital market", "What can be capital market", "what do you mean by capital market"], "responses": ["Capital markets are the markets where securities such as shares and bonds are issued to raise medium to long-term financing."]}, {"tag": "Capital ratio", "patterns": ["what is mean by capital ratio?", "do you know Capital ratio?", "Tell me about capital ratio", "capital ratio", "What can be capital ratio", "what do you mean by capital ratio"], "responses": ["A commercial bank's capital ratio measures the funds it has in reserve against the riskier assets it holds that could be vulnerable in the event of a crisis.", "the extent to which a financial institution finances its operations by issuing shares and retaining profits, expressed as a percentage of its assets."]}, {"tag": "Credit risk", "patterns": ["what is mean by credit risk?", "do you know credit risk?", "Tell me about credit risk", "what is credit risk", "credit risk", "What can be credit risk", "what do you mean by credit risk"], "responses": ["Credit risk is the possibility of a loss resulting from a borrower's failure to repay a loan or meet contractual obligations", "This is the risk to the commercial bank of lending to borrowers who turn out to be unable to repay their loans."]}, {"tag": "Crowdfunding", "patterns": ["what is mean by crowdfunding?", "do you know crowdfunding?", "Tell me about crowdfunding", "what is crowdfunding?", "crowdfunding", "What can be crowdfunding", "what do you mean by crowdfunding"], "responses": ["Crowdfunding is a form of equity finance that has grown rapidly in the USA and the UK in particular.", "Crowdfunding involves the collective effort of a large number of individuals who network and pool small amounts of their capital to finance a new or existing business venture. Social causes remain the most active source of crowdfunding activity.", " Crowdfunding is the use of small amounts of capital from a large number of individuals to finance a new business venture."]}, {"tag": "cryptocurrency", "patterns": ["what is mean by cryptocurrency?", "do you know cryptocurrency?", "what is cryptocurrency", "Tell me about cryptocurrency", "cryptocurrency", "What can be cryptocurrency", "what do you mean by cryptocurrency"], "responses": ["A cryptocurrency is a digital or virtual currency that uses cryptography and is difficult to counterfeit because of this security feature.", "A cryptocurrency is a digital or virtual currency designed to work as a medium of exchange"]}, {"tag": "Demonetisation", "patterns": ["what is mean by demonetisation?", "do you know about demonetization that happened in our India in 2016?", "what is demonetisation", "What can be demonetisation", "what do you mean by demonetisation", "Tell me about demonetisation", "Demonetisation in India", "Demonetisation"], "responses": ["Yes,Demonetization is the act of stripping a currency unit of its status as legal tender.", "Demonetisation is a process of removing a unit of currency from circulation by stripping it of its legal tender status", "Yes, Demonetization occurs when a governing body cancels the legal tender status of a currency unit in circulation."]}, {"tag": "Financial crisis", "patterns": ["what is mean by financial crisis in a country?", "do you know bank capital?", "Tell me about bank capital", "bank capital", "What can be bank capital", "what do you mean by bank capital"], "responses": ["A disturbance to financial markets, associated typically with falling asset prices and insolvency amongst debtors and intermediaries, which ramifies through the financial system, disrupting the market’s capacity to allocate capital", "A financial crisis is a situation where the value of assets drop rapidly and is often triggered by a panic or a run on banks."]}, {"tag": "liquidity", "patterns": ["what is mean by liquidity?", "do you know liquidity in financial markets?", "what is liquidity?", "liquidity", "What can be liquidity", "what do you mean by liquidity"], "responses": ["Liquidity means the ease and cost with which assets can be turned into cash and used immediately as a means of exchange. Cash is very liquid whereas a life assurance policy is less so.", "It is the the availability of liquid assets such as cash to a market or company."]}, {"tag": "leverage", "patterns": ["what is mean by leverage?", "do you know about leverage?", "do you know leverage?", "Tell me about leverage", "leverage", "What can be leverage", "what do you mean by leverage"], "responses": ["Leverage is the use of borrowed funds to increase profitability. One measure of leverage is the amount of long term debt relative to equity", "Leverage is an investment strategy of using borrowed money—specifically, the use of various financial instruments or borrowed capital—to increase the potential return of an investment", "Financial leverage which is also known as leverage or trading on equity, refers to the use of debt to acquire additional assets."]}, {"tag": "liquidity trap", "patterns": ["what is mean by liquidity trap?", "do you know liquidity trap?", "Hey tell me what is liquidity trap", "what is liquidity trap?", "liquidity trap", "What can be liquidity trap", "what do you mean by liquidity trap"], "responses": ["A liquidity trap occurs when low interest rates and a high amount of cash balances in the economy fail to stimulate aggregate demand partly through a lack of confidence."]}, {"tag": "Monetary stability", "patterns": ["what is mean by monetary stability?", "do you know about monetary stability?", "Tell me about what exactly monetary stability is.", "what is monetary stability", "Monetary Stability", "What can be Monitary Stability", "what do you mean by Monitary stability"], "responses": ["Monetary stability means stable prices and confidence in the currency. ", "Monetary stability is a synonym for price stability. Price stability refers to a stable price level or a low level of inflation and not to stable individual prices"]}, {"tag": "Moral hazard", "patterns": ["what is moral hazard?", "what is mean by moral hazard?", "tell me an example of moral hazard?", "do you know moral hazard", "moral hazard", "What can be moral hazard", "what do you mean by moral hazard"], "responses": ["When the party with superior information alters his/her behaviour in such a way that benefits himself while imposing costs on those with inferior information.", "For example, moral hazard occurs when insured consumers are likely to take greater risks, knowing that a claim will be paid for by their cover. The consumer knows more about his/her intended actions than the producer (e.g. the insurer)."]}, {"tag": "nominal interest rate", "patterns": ["what is mean by nominal interest rate?", "do you know nominal interest rate?", "what is nominal interest rate?", "Tell me about nominal interest rate", "nominal interest rate", "What can be nominal interest rate", "what do you mean by nominal interest rate"], "responses": ["The nominal interest rate is the interest rate on a loan or on savings deposits unadjusted for the rate of inflation.", "In short, it is the sum of real interest rate and inflation"]}, {"tag": "real interest rate", "patterns": ["what is mean by real interest rate?", "do you know real interst rate?", "what is real interest rate", "Tell me about real interest rate", "real interest rate", "what can be real interest rate?", "What do you mean by real interest rate"], "responses": ["A real interest rate is an interest rate that has been adjusted to remove the effects of inflation to reflect the real cost of funds to the borrower and the real yield to the lender or to an investor.", "The real interest rate reflects the rate of time-preference for current goods over future goods."]}, {"tag": "narrow money", "patterns": ["what is mean by narrow money?", "do you know narrow money in financial markets?", "what is narrow money", "Tell me about Narrow money", "Narrow money", "what can be Narrow money", "What do you mean by Narrow money"], "responses": ["Narrow money refers to a category of money supply that includes all the real money held by the central bank. It includes coins and currency, demand deposits, and other liquid assets.", "The narrow money definition of the money supply is a measure of the value coins and notes in circulation and other money equivalents that are easily convertible into cash such as short term deposits in the banking system."]}, {"tag": "passporting", "patterns": ["what is mean by pass porting?", "do you know passporting?", "what is passporting", "Tell me about passporting", "passporting", "What can be passporting", "what do you mean by passporting"], "responses": ["Passporting allows a firm registered in the European Economic Area (EEA) to do business in any other EEA state without the need for further authorization from each country.", "EU legislation gives UK banks, insurers and investment firms ‘passporting’ rights to provide a range of financial services to clients across the EU – either cross-border or through local branches – while remaining regulated solely by their ‘home’ state."]}, {"tag": "PRA", "patterns": ["what is mean by Prudential Regulation Authority or PRA?", "do you know PRA?", "what is PRA", "PRA", "what can be PRA"], "responses": ["The PRA is part of the Bank of England and is responsible for the prudential regulation and supervision of around 1,700 banks, building societies, credit unions, insurers and major investment firms.", "The PRA has a particular focus on the solvency of specific financial markets such as: Insurance providers, Buy-to-let mortgage lenders, Credit unions and other specialist lenders."]}, {"tag": "Ring Fence", "patterns": ["what is mean by ring-fence?", "do you know ring fence?", "Ring fencing?", "what is ring fence", "Tell me about ring fence", "Ring Fence"], "responses": ["A ring-fence is a virtual barrier that segregates a portion of an individual's or company's financial assets from the rest.", "Ringfencing is when a regulated public utility business financially separates itself from a parent company that engages in non-regulated business."]}, {"tag": "VAR", "patterns": ["what is mean by Value at risk?", "do you know VAR?", "what is exactly VAR?", "what is VAR", "Tell me about VAR", "Do you know Value at Risk", "VAR", "Value at Risk"], "responses": ["Value at risk is a measure of the maximum loss expected on an investment.", "For example, a 2% value at risk of a £3 million investment means that there is a 2% chance that a portfolio will lose £3 million in a given year."]}, {"tag": "Compound interest", "patterns": ["What is mean by Compound interest", "Compound interest", "what is compound interest", "Tell me about compound interest", "Do you know compound interest?", "What can be compound interest", "What do you mean by compound interest"], "responses": ["It is the interest on the amount of money you have deposited or borrowed", "When you are investing or saving, compound interest is charged on the original amount you have accumulated over time"]}, {"tag": "FICO score", "patterns": ["What is Fico Score", "What is mean by Fico Score", "Fico Score means?", "Fico score", "Do you know Fico Score", "Tell me about Fico Score", "What can be Fico score"], "responses": ["Your Fico score is based on several factors including payment history, the length of your credit history and total amount owed", "Fico Score Reanges from 300 to 850, and the higher the score,the better the terms you may receive on your next loan or credit card.", "People with Fico scores below 620 may have a harder time securing credit at a favourable interest rate"]}, {"tag": "Net Worth", "patterns": ["What is Net Worth", "What is mean by Net Worth", "net worth means?", "Net worth", "Do you know Net Worth", "Tell me about Net worth", "What does Net worth do?", "What do you mean by Net worth", "what can be networth"], "responses": ["Your networth is simply the difference between your assets"]}, {"tag": "Asset allocation", "patterns": ["What is Asset allocation", "What is mean by Asset allocation", "Asset allocation means?", "Asset allocation", "Do you know Asset allocation", "Tell me about Asset allocation", "What does Asset allocation do?", "What `do you mean by Asset allocation", "what can be Asset allocation"], "responses": ["Asset allocation is where you choose to put your money", "The three major asset classes are stocks, bonds, and cash"]}, {"tag": "Term life insurance", "patterns": ["What is term life insurance", "Do you know term life insurance", "what is mean by term life insurance", "Tell me about term life insurance"], "responses": ["Term life insurance provide coverage over a set period, generally anywhere from five to 30 years", "If you die within the set term, your beneficiaries receive a payout. If you don't,the policy expires with no value."]}, {"tag": "Thank you", "patterns": ["Thank you", "Thank you so much for your help"], "responses": ["Its my pleasure.", "You are welcome", "No problem. Its my pleasure to help you"]}]}